Revit 2020 API
InstanceNode Class
 An output node that represents a family instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2014
Syntax
C#
public class InstanceNode : GroupNode
Visual Basic
Public Class InstanceNode _
	Inherits GroupNode
Visual C++
public ref class InstanceNode : public GroupNode
Remarks
 See also: [!:Autodesk::Revit::DB::IExportContext::OnInstanceBegin].
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.GroupNode
 Autodesk.Revit.DB.InstanceNode
See Also
InstanceNode Members
Autodesk.Revit.DB Namespace